# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

# Set cask installation location
cask_args appdir: '/Applications'

# Get updated bash
brew "bash"
brew "bash-completion@2"

# Git
brew "git"
brew "git-lfs"

# Vim
brew "vim"

# Updated tools
brew "grep"
brew "openssh"
brew "screen"
brew "ssh-copy-id"

# GnuPG 
brew "gnupg"

# Other binaries
brew "smartmontools"

# Mac App Store installer
brew "mas"

# Casks
cask "firefox"
cask "brave-browser"
cask "vlc"
cask "visual-studio-code"
cask "signal"
cask "cryptomator"
cask "standard-notes"

