# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Set cask installation location
cask_args appdir: '/Applications'

# Get updated bash
brew "bash"
brew "bash-completion@2"

# Git
brew "git"
brew "git-lfs"

# Vim
brew "vim"
brew "fzf"

# Updated tools
brew "grep"
brew "openssh"
brew "screen"
brew "ssh-copy-id"

# GnuPG 
brew "gnupg"

# Dev tools/langs
brew "go"
brew "rust"
brew "mysql"
brew "php"

# Other binaries
brew "smartmontools"
brew "wget"
brew "tmux"
brew "ripgrep"

# Mac App Store installer
brew "mas"

# Casks
cask "protonvpn"
cask "firefox"
cask "yubico-authenticator"
cask "tresorit"
cask "standard-notes"
cask "cryptomator"
cask "brave-browser"
cask "vlc"
cask "visual-studio-code"
cask "signal"
cask "discord"
cask "zoom"
cask "r"
cask "rstudio"

# Mac App Store programs
mas "Bitwarden", id: 1352778147
mas "Pages", id: 409201541

# VSCode Extensions
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "vscodevim.vim"